re20_3_forCarson_nopatch/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    quarterpi 
    {
        type    lineCell;
        axis    xyz;
        start   (0.35 0.35 0.0);
        end     (1.1 1.1 0.0);
    }
    halfpi 
    {
        type    lineCell;
        axis    xyz;
        start   (0.0 0.5 0.0);
        end     (0.0 1.5 0.0);
    }
    threequarterpi 
    {
        type    lineCell;
        axis    xyz;
        start   (-0.35 0.35 0.0);
        end     (-1.1 1.1 0.0);
    }
    recirc 
    {
        type    lineCell;
        axis    xyz;
        start   (0.5 0.0 0.0);
        end     (10.5 0.0 0.0);
    }
    WakeProfile2d 
    {
        type    lineCell;
        axis    xyz;
        start   (2.0 -20.0 0.0);
        end     (2.0 20.0 0.0);
    }
    WakeProfile4d 
    {
        type    lineCell;
        axis    xyz;
        start   (4.0 -20.0 0.0);
        end     (4.0 20.0 0.0);
    }

);

fields          ( p U );


// ************************************************************************* //
